# Session 01: The Python Data Science Ecosystem

In [3]:
import pandas as pd

## Read Data

In [15]:
df = pd.read_csv(
    r"C:\Users\team-\Desktop\data_science_SE42\names/yob2023.txt",
    sep=",",
    skiprows=0,
    names=["name", "gender", "count"],
    index_col=None,
    )

## Inspect DataFrames

In [24]:
# number of rows and columns
df.shape

(31803, 3)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31803 entries, 0 to 31802
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    31803 non-null  object
 1   gender  31803 non-null  object
 2   count   31803 non-null  int64
dtypes: int64(1), object(2)
memory usage: 745.5+ KB

In [23]:
# find missing data
df.isna().sum()

name      0
gender    0
count     0
dtype: int64

## Filter rows

In [35]:
df[df["count"] > 10000]

            name gender  count
0         Olivia      F  15313
1           Emma      F  13579
2      Charlotte      F  12628
3         Amelia      F  12352
4         Sophia      F  11984
5            Mia      F  11395
6       Isabella      F  10853
17597       Liam      M  20886
17598       Noah      M  19088
17599     Oliver      M  14782
17600      James      M  11727
17601     Elijah      M  11503
17602      Mateo      M  11279
17603   Theodore      M  11084
17604      Henry      M  10988
17605      Lucas      M  10882
17606    William      M  10653
17607   Benjamin      M  10212

In [42]:
girls.shape[0], boys.shape[0]

(17597, 14206)

In [37]:
girls = df[df["gender"] == "F"]
boys = df[df["gender"] == "M"]

girls["count"].sum(), boys["count"].sum()

(np.int64(1602645), np.int64(1708551))

In [38]:
df[df["gender"] == "F"]
# df.filter(..)

            name gender  count
0         Olivia      F  15313
1           Emma      F  13579
2      Charlotte      F  12628
3         Amelia      F  12352
4         Sophia      F  11984
...          ...    ...    ...
17592       Zuni      F      5
17593       Zura      F      5
17594  Zurisadai      F      5
17595    Zyairah      F      5
17596        Zyn      F      5

[17597 rows x 3 columns]

### Extra: functions that behave like attributes

In [39]:
class Foo:

    @property
    def bar(self):
        return 2 **8

In [ ]:
f = Foo()
f.bar

TypeError: 'int' object is not callable